#development
cask "visual-studio-code"
brew "python@3.8"
mas "Microsoft-Remote-Desktop", id: 1295203466
mas "Sip", id: 507257563
mas "JSON-Validator", id: 457563999
#TODO:cask "iterm2"
cask "virtualbox"
cask "docker"
cask "lens"
cask "insomnia"
#TODO:cask "fork"

#utilities
mas "amphetamine", id: 937984704
mas "colors-for-hue", id: 581915465
mas "the-unarchiver", id: 425424353
cask "ubersicht"
cask "balenaetcher"
cask "sdformatter"
cask "coconutbattery"
cask "app-cleaner"
cask "bettertouchtool"
brew "neofetch"
brew "koekeishiya/formulae/yabai"

#social
cask "discord"
cask "twist"
cask "signal"
mas "whatsapp", id: 1147396723
mas "slack", id: 803453959

#productivity
mas "pocket", id: 568494494
mas "1password", id: 1333542190
mas "agenda", id: 1287445660
mas "fantastical", id: 975937182
mas "todoist", id: 585829637
cask "firefox"
cask "krita"

#office
mas "pages", id: 409201541
mas "keynote", id: 409183694
mas "numbers", id: 409203825
mas "ia-writer", id: 775737590

#network & security
mas "wireguard", id: 1451685025
mas "nordvpn", id: 1116599239
cask "tunnelblick"
brew "wireshark"

#multimedia
mas "Helium", id: 1054607607
#cask "spotify"
cask "steam"
cask "vlc"
brew "Rigellute/tap/spotify-tui"
#TODO: spotifyd

#TODO: padbury_clock screensaver
#TODO: ON1 Photo Raw
#TODO: Hue Sync
#TODO: Jellyfin
#TODO: DaVinci Resolve
#TODO: Autenticação.gov
#TODO: oh-my-zsh