#development
brew "python@3.8"
mas "Microsoft-Remote-Desktop", id: 1295203466
mas "Sip", id: 507257563
mas "JSON-Validator", id: 457563999
cask "iterm2"
cask "visual-studio-code"
cask "virtualbox"
cask "docker"
cask "lens"
cask "insomnia"
cask "fork"

#utilities
mas "Amphetamine", id: 937984704
mas "Colors-for-Hue", id: 581915465
mas "The-Unarchiver", id: 425424353
cask "ubersicht"
cask "balenaetcher"
cask "sdformatter"
cask "coconutbattery"
cask "app-cleaner"
cask "bettertouchtool"

#social
cask "discord"
cask "twist"
cask "signal"
mas "Whatsapp", id: 1147396723
mas "Slack", id: 803453959

#productivity
mas "Pocket", id: 1477385213
mas "1password", id: 1333542190
mas "Agenda", id: 1287445660
mas "Fantastical", id: 975937182
mas "Todoist", id: 585829637
cask "firefox"
cask "krita"

#office
mas "Pages", id: 409201541
mas "Keynote" id: 409183694
mas "Numbers" id: 409203825
mas "iA-Writer", id: 775737590

#network & security
mas "Wireguard", id: 1451685025
mas "NordVPN", id: 1116599239
cask "tunnelblick"
brew "wireshark"

#multimedia
mas "Helium", id: 1054607607
cask "spotify"
cask "steam"
cask "vlc"
