#development
cask "visual-studio-code"
brew "python@3.8"
mas "Microsoft-Remote-Desktop", id: 1295203466
mas "Sip", id: 507257563
mas "JSON-Validator", id: 457563999
#TODO:cask "iterm2"
cask "virtualbox"
cask "docker"
#cask "lens"
#cask "insomnia"
#cask "fork"

#utilities
mas "amphetamine", id: 937984704
#mas "colors-for-hue", id: 581915465
mas "the-unarchiver", id: 425424353
cask "ubersicht"
cask "balenaetcher"
cask "sdformatter"
cask "coconutbattery"
cask "app-cleaner"
cask "bettertouchtool"
brew "neofetch"
#TODO: yabai

#social
cask "discord"
cask "twist"
cask "signal"
mas "whatsapp", id: 1147396723
mas "slack", id: 803453959

#productivity
mas "Pocket", id: 568494494
#TODO:mas "1password", id: 1333542190
mas "Agenda", id: 1287445660
#TODO:mas "Fantastical", id: 975937182
mas "Todoist", id: 585829637
#TODO:cask "firefox"
cask "krita"

#office
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "iA-Writer", id: 775737590

#network & security
#TODO:mas "Wireguard", id: 1451685025
mas "NordVPN", id: 1116599239
#TODO:cask "tunnelblick"
brew "wireshark"

#multimedia
mas "Helium", id: 1054607607
#cask "spotify"
cask "steam"
cask "vlc"
brew "Rigellute/tap/spotify-tui"
#TODO: spotifyd

#TODO: padbury_clock screensaver
#TODO: ON1 Photo Raw
#TODO: Hue Sync
#TODO: Jellyfin
#TODO: DaVinci Resolve
#TODO: Autenticação.gov